Revit 2026 API

# BumpMap Class

---

A static class that provides access to the property names that appear in the BumpMap visual asset schema.

SystemObject Autodesk.Revit.DB.VisualBumpMap

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class BumpMap
```
```vb
Public NotInheritable Class BumpMap
```
```cpp
public ref class BumpMap abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BumpMap = class end
```

The BumpMap type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BumpmapBitmap | The property labeled "Source" from the "BumpMap" schema. |
|  | BumpmapDepth | The property labeled "Amount" from the "BumpMap" schema. |
|  | BumpmapNormalScale | The property labeled "Amount" from the "BumpMap" schema. |
|  | BumpmapType | The property labeled "Bump Type" from the "BumpMap" schema. |
|  | TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "BumpMap" schema. |
|  | TextureOffsetLock | The property labeled "Offset Lock" from the "BumpMap" schema. |
|  | TextureRealWorldOffsetX | The property labeled "Offset X" from the "BumpMap" schema. |
|  | TextureRealWorldOffsetY | The property labeled "Offset Y" from the "BumpMap" schema. |
|  | TextureRealWorldScaleX | The property labeled "Size X" from the "BumpMap" schema. |
|  | TextureRealWorldScaleY | The property labeled "Size Y" from the "BumpMap" schema. |
|  | TextureScaleLock | The property labeled "Scale Lock" from the "BumpMap" schema. |
|  | TextureURepeat | The property labeled "U Repeat" from the "BumpMap" schema. |
|  | TextureVRepeat | The property labeled "V Repeat" from the "BumpMap" schema. |
|  | TextureWAngle | The property labeled "Angle" from the "BumpMap" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace